******** Choose profile
         :PROPERTIES:
         :ID:       492ad298-5b52-4cb4-913c-a444940d9492
         :END:
         #+BEGIN_SRC bash :results verbatim
mdevctl types
         #+END_SRC

         #+RESULTS:
         #+begin_example
         0000:2b:00.0
           nvidia-156
             Available instances: 0
             Device API: vfio-pci
             Name: GRID P40-2B
             Description: num_heads=4, frl_config=45, framebuffer=2048M, max_resolution=5120x2880, max_instance=12
           nvidia-215
             Available instances: 0
             Device API: vfio-pci
             Name: GRID P40-2B4
             Description: num_heads=4, frl_config=45, framebuffer=2048M, max_resolution=5120x2880, max_instance=12
           nvidia-241
             Available instances: 0
             Device API: vfio-pci
             Name: GRID P40-1B4
             Description: num_heads=4, frl_config=45, framebuffer=1024M, max_resolution=5120x2880, max_instance=24
           nvidia-283
             Available instances: 0
             Device API: vfio-pci
             Name: GRID P40-4C
             Description: num_heads=1, frl_config=60, framebuffer=4096M, max_resolution=4096x2160, max_instance=6
           nvidia-284
             Available instances: 0
             Device API: vfio-pci
             Name: GRID P40-6C
             Description: num_heads=1, frl_config=60, framebuffer=6144M, max_resolution=4096x2160, max_instance=4
           nvidia-285
             Available instances: 0
             Device API: vfio-pci
             Name: GRID P40-8C
             Description: num_heads=1, frl_config=60, framebuffer=8192M, max_resolution=4096x2160, max_instance=3
           nvidia-286
             Available instances: 0
             Device API: vfio-pci
             Name: GRID P40-12C
             Description: num_heads=1, frl_config=60, framebuffer=12288M, max_resolution=4096x2160, max_instance=2
           nvidia-287
             Available instances: 0
             Device API: vfio-pci
             Name: GRID P40-24C
             Description: num_heads=1, frl_config=60, framebuffer=24576M, max_resolution=4096x2160, max_instance=1
           nvidia-46
             Available instances: 0
             Device API: vfio-pci
             Name: GRID P40-1Q
             Description: num_heads=4, frl_config=60, framebuffer=1024M, max_resolution=5120x2880, max_instance=24
           nvidia-47
             Available instances: 0
             Device API: vfio-pci
             Name: GRID P40-2Q
             Description: num_heads=4, frl_config=60, framebuffer=2048M, max_resolution=7680x4320, max_instance=12
           nvidia-48
             Available instances: 6
             Device API: vfio-pci
             Name: GRID P40-3Q
             Description: num_heads=4, frl_config=60, framebuffer=3072M, max_resolution=7680x4320, max_instance=8
           nvidia-49
             Available instances: 0
             Device API: vfio-pci
             Name: GRID P40-4Q
             Description: num_heads=4, frl_config=60, framebuffer=4096M, max_resolution=7680x4320, max_instance=6
           nvidia-50
             Available instances: 0
             Device API: vfio-pci
             Name: GRID P40-6Q
             Description: num_heads=4, frl_config=60, framebuffer=6144M, max_resolution=7680x4320, max_instance=4
           nvidia-51
             Available instances: 0
             Device API: vfio-pci
             Name: GRID P40-8Q
             Description: num_heads=4, frl_config=60, framebuffer=8192M, max_resolution=7680x4320, max_instance=3
           nvidia-52
             Available instances: 0
             Device API: vfio-pci
             Name: GRID P40-12Q
             Description: num_heads=4, frl_config=60, framebuffer=12288M, max_resolution=7680x4320, max_instance=2
           nvidia-53
             Available instances: 0
             Device API: vfio-pci
             Name: GRID P40-24Q
             Description: num_heads=4, frl_config=60, framebuffer=24576M, max_resolution=7680x4320, max_instance=1
           nvidia-54
             Available instances: 0
             Device API: vfio-pci
             Name: GRID P40-1A
             Description: num_heads=1, frl_config=60, framebuffer=1024M, max_resolution=1280x1024, max_instance=24
           nvidia-55
             Available instances: 0
             Device API: vfio-pci
             Name: GRID P40-2A
             Description: num_heads=1, frl_config=60, framebuffer=2048M, max_resolution=1280x1024, max_instance=12
           nvidia-56
             Available instances: 0
             Device API: vfio-pci
             Name: GRID P40-3A
             Description: num_heads=1, frl_config=60, framebuffer=3072M, max_resolution=1280x1024, max_instance=8
           nvidia-57
             Available instances: 0
             Device API: vfio-pci
             Name: GRID P40-4A
             Description: num_heads=1, frl_config=60, framebuffer=4096M, max_resolution=1280x1024, max_instance=6
           nvidia-58
             Available instances: 0
             Device API: vfio-pci
             Name: GRID P40-6A
             Description: num_heads=1, frl_config=60, framebuffer=6144M, max_resolution=1280x1024, max_instance=4
           nvidia-59
             Available instances: 0
             Device API: vfio-pci
             Name: GRID P40-8A
             Description: num_heads=1, frl_config=60, framebuffer=8192M, max_resolution=1280x1024, max_instance=3
           nvidia-60
             Available instances: 0
             Device API: vfio-pci
             Name: GRID P40-12A
             Description: num_heads=1, frl_config=60, framebuffer=12288M, max_resolution=1280x1024, max_instance=2
           nvidia-61
             Available instances: 0
             Device API: vfio-pci
             Name: GRID P40-24A
             Description: num_heads=1, frl_config=60, framebuffer=24576M, max_resolution=1280x1024, max_instance=1
           nvidia-62
             Available instances: 0
             Device API: vfio-pci
             Name: GRID P40-1B
             Description: num_heads=4, frl_config=45, framebuffer=1024M, max_resolution=5120x2880, max_instance=24

         #+end_example

         I chose nvidia-47 (GRID P40-3Q) because it has 3Q at the end of its name. This means I can have two 3GB vGPU's running.

******** Determine GPU PCI address
         #+BEGIN_SRC bash :results verbatim
lspci | grep VGA
PCI_ADDRESS=$(lspci | grep VGA | grep -Po '\d\w:\d\d.\d')
echo $PCI_ADDRESS
         #+END_SRC

         #+RESULTS:
         : 2b:00.0 VGA compatible controller: NVIDIA Corporation GP106 [GeForce GTX 1060 6GB] (rev a1)
         : 2b:00.0

******** Generate UUIDs for each vGPU
         #+BEGIN_SRC bash
UUID1=$(uuidgen)
UUID2=$(uuidgen)
echo $UUID1 $UUID2
         #+END_SRC

         #+RESULTS:
         : 2e82a1ad-3c7a-4b79-869f-3637b6b299a7 7a9c2eda-fa37-49f7-bb97-069c679b6eef

